---
kind: property
id: P:Autodesk.Revit.DB.DividedSurface.AllGridRotation
source: html/7e0b73cf-13dc-658f-e597-442c0efe6ae9.htm
---
# Autodesk.Revit.DB.DividedSurface.AllGridRotation Property

Angle of rotation applied to the U- and V- directions together.

## Syntax (C#)
```csharp
public double AllGridRotation { get; set; }
```